bundles/org.openhab.binding.ihc/src/test/resources/GetProjectInfoResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getProjectInfo1 xmlns:ns1="utcs" xsi:type="ns1:WSProjectInfo">
<ns1:visualMinorVersion xsi:type="xsd:int">3</ns1:visualMinorVersion>

<ns1:visualMajorVersion xsi:type="xsd:int">3</ns1:visualMajorVersion>

<ns1:projectMajorRevision xsi:type="xsd:int">218958359</ns1:projectMajorRevision>

<ns1:projectMinorRevision xsi:type="xsd:int">219293703</ns1:projectMinorRevision>

<ns1:lastmodified xsi:type="ns1:WSDate">
<ns1:day xsi:type="xsd:int">13</ns1:day>

<ns1:monthWithJanuaryAsOne xsi:type="xsd:int">5</ns1:monthWithJanuaryAsOne>

<ns1:hours xsi:type="xsd:int">18</ns1:hours>

<ns1:minutes xsi:type="xsd:int">40</ns1:minutes>

<ns1:seconds xsi:type="xsd:int">0</ns1:seconds>

<ns1:year xsi:type="xsd:int">2018</ns1:year>
</ns1:lastmodified>

<ns1:projectNumber xsi:type="xsd:string">1</ns1:projectNumber>

<ns1:customerName xsi:type="xsd:string">Pertti 'Speedy' Keinonen</ns1:customerName>

<ns1:installerName xsi:type="xsd:string"></ns1:installerName>
</ns1:getProjectInfo1>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>