addons/binding/org.openhab.binding.ihc.test/src/test/resources/GetProjectSegmentResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ns1:getIHCProjectSegment4 xmlns:ns1="utcs" xsi:type="ns1:WSFile">
<ns1:filename xsi:type="xsd:string">unknown.bin</ns1:filename>

<ns1:data xsi:type="xsd:base64Binary">LvVF4VWSi0WqRKps7lGH6U....OBCl1gwKGbvYM1SDh</ns1:data>
</ns1:getIHCProjectSegment4>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>